tests/fixtures/wechathk_sample.json

[
  {
    "retcode": "0",
    "retmsg": "OK",
    "amount_in_cent": "2718",
    "bank_name": "Mastercard|1863|",
    "business_desc": "100",
    "card_amount": "2718",
    "card_tail": "1863",
    "charge": "0",
    "currency_code": "HK$",
    "cvActName": "",
    "cvPayMoney": "",
    "datetime": "1747025354",
    "description": "点餐-深圳天安云谷店",
    "en_mer_name": "",
    "extern_memo": "",
    "extern_memo2": "2|CNY",
    "extern_memo3": "1863",
    "foreign_price": "￥25.00",
    "foreign_rate": "1CNY=1.08719HKD",
    "inner_app_id": "",
    "instrument": "CREDITCARD",
    "is_apple_contract": "0",
    "is_combined_payment": "0",
    "list_type": "101",
    "mch_card_type": "",
    "mch_card_url": "",
    "merchant": "Manner Coffee",
    "merchant_id": "3200020110",
    "merchant_id0": "3200020110",
    "out_trade_no": "202505127480190939811C",
    "p2pfee": "0",
    "pay_state": "0",
    "payrecord_id": "4200002700202505129525209429",
    "product_desc": "点餐-深圳天安云谷店",
    "raw_amount": "2718",
    "refund_channel": "0",
    "show_sub_orders": "0",
    "standby2": "0",
    "type": "Payment"
  },
  {
    "retcode": "0",
    "retmsg": "OK",
    "amount_in_cent": "4800",
    "bank_name": "Mastercard|1863|",
    "business_desc": "100",
    "card_amount": "4800",
    "card_tail": "1863",
    "charge": "0",
    "currency_code": "HK$",
    "cvActName": "",
    "cvPayMoney": "",
    "datetime": "1716352961",
    "description": "Telecom Payment",
    "en_mer_name": "",
    "extern_memo": "",
    "extern_memo2": "2|HKD",
    "extern_memo3": "1863",
    "inner_app_id": "",
    "instrument": "CREDITCARD",
    "is_apple_contract": "0",
    "is_combined_payment": "0",
    "list_type": "101",
    "mch_card_type": "",
    "mch_card_url": "",
    "merchant": "Hutchison Telephone Company Limited",
    "merchant_id": "3200088534",
    "merchant_id0": "3200088534",
    "out_trade_no": "1783975000202405225610386524",
    "p2pfee": "0",
    "pay_state": "0",
    "payrecord_id": "4200002213202405221103412607",
    "product_desc": "Telecom Payment",
    "raw_amount": "5000",
    "refund_channel": "0",
    "show_sub_orders": "0",
    "standby2": "0",
    "type": "Payment",
    "discount": [
      {
        "discount_amount": "200",
        "discount_guide": "HK$2 Telecom Payment exclusive e-cash voucher"
      }
    ]
  },
  {
    "retcode": "0",
    "retmsg": "OK",
    "acc_time": "1718503213",
    "amount_in_cent": "9900",
    "bank_name": "4551|4193|",
    "business_desc": "7",
    "card_amount": "9900",
    "card_tail": "4193",
    "charge": "0",
    "create_time": "1718502315",
    "currency_code": "HK$",
    "cvActName": "",
    "cvPayMoney": "",
    "datetime": "1718503213",
    "description": "luckymoney",
    "en_mer_name": "",
    "extern_memo": "1010013000000101202406155573025265",
    "extern_memo2": "",
    "extern_memo3": "",
    "inner_app_id": "",
    "instrument": "BANK ACCOUNT",
    "is_apple_contract": "0",
    "is_combined_payment": "0",
    "list_type": "125",
    "mch_card_type": "",
    "mch_card_url": "",
    "merchant": "WeChat利是",
    "merchant_id": "3000000101",
    "merchant_id0": "3000000101",
    "modify_time": "1718503213",
    "out_trade_no": "1020023000000101202406165580089456265",
    "p2pfee": "0",
    "pay_state": "9",
    "payrecord_id": "1020023000000101202406165580089457265",
    "product_desc": "luckymoney",
    "raw_amount": "9900",
    "refundCardAmount": "9900",
    "refundCvPayMoney": "0",
    "refund_channel": "0",
    "refund_mer_amount": "9900",
    "refund_success_time": "1718503213",
    "show_sub_orders": "0",
    "standby2": "101"
  },
  {
    "retcode": "0",
    "retmsg": "OK",
    "amount_in_cent": "9900",
    "bank_name": "4551|4193|",
    "business_desc": "7",
    "card_amount": "9900",
    "card_tail": "4193",
    "charge": "0",
    "currency_code": "HK$",
    "cvActName": "",
    "cvPayMoney": "",
    "datetime": "1718415912",
    "description": "luckymoney",
    "en_mer_name": "",
    "extern_memo": "",
    "extern_memo2": "",
    "extern_memo3": "4193",
    "inner_app_id": "",
    "instrument": "BANK ACCOUNT",
    "is_apple_contract": "0",
    "is_combined_payment": "0",
    "list_type": "101",
    "mch_card_type": "",
    "mch_card_url": "",
    "merchant": "WeChat利是",
    "merchant_id": "3000000101",
    "merchant_id0": "3000000101",
    "out_trade_no": "300000010120240615780500169400",
    "p2pfee": "0",
    "pay_state": "7",
    "payrecord_id": "1010013000000101202406155573025265",
    "product_desc": "luckymoney",
    "raw_amount": "9900",
    "refund_channel": "0",
    "show_sub_orders": "0",
    "standby2": "0",
    "type": "Payment",
    "refund_record": [
      {
        "draw_id": "1020023000000101202406165580089457265",
        "refund_amount": "9900",
        "refund_state": "9",
        "refund_success_time": "1718503213",
        "refund_time": "1718502314",
        "single_exist": "1"
      }
    ]
  },
  {
    "retcode": "0",
    "retmsg": "OK",
    "amount_in_cent": "61826",
    "bank_name": "Mastercard|1863|",
    "business_desc": "100",
    "card_amount": "61826",
    "card_tail": "1863",
    "charge": "0",
    "currency_code": "HK$",
    "cvActName": "",
    "cvPayMoney": "",
    "datetime": "1746791739",
    "description": "Costco China - 1016661903",
    "en_mer_name": "",
    "extern_memo": "",
    "extern_memo2": "2|CNY",
    "extern_memo3": "1863",
    "foreign_price": "￥570.80",
    "foreign_rate": "1CNY=1.08314HKD",
    "inner_app_id": "",
    "instrument": "CREDITCARD",
    "is_apple_contract": "0",
    "is_combined_payment": "0",
    "list_type": "101",
    "mch_card_type": "",
    "mch_card_url": "",
    "merchant": "Costco开市客",
    "merchant_id": "3200020110",
    "merchant_id0": "3200020110",
    "out_trade_no": "1016661903",
    "p2pfee": "0",
    "pay_state": "0",
    "payrecord_id": "4200002686202505098141784440",
    "product_desc": "Costco China - 1016661903",
    "raw_amount": "61826",
    "refund_channel": "0",
    "show_sub_orders": "0",
    "standby2": "0",
    "type": "Payment"
  }
]
